---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PreferDimSideUiFilter
source: html/eb2f1be9-d94f-274a-4bc0-03400199d037.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PreferDimSideUiFilter Property

"Prefer:": This is used by the UI to allow select prefer dimension side.

## Syntax (C#)
```csharp
public static ForgeTypeId PreferDimSideUiFilter { get; }
```